---
kind: type
id: T:Autodesk.Revit.DB.Visual.MasonryCMUApplicationType
source: html/d1897557-b739-f87c-1482-5f1ab98550d6.htm
---
# Autodesk.Revit.DB.Visual.MasonryCMUApplicationType

The enumerated type representing the permitted values for the asset property "MasonryCMUApplication" from the "MasonryCMU" schema.

## Syntax (C#)
```csharp
public enum MasonryCMUApplicationType
```